[
  {
    "title": "1. Walking",
    "howToDo": "Start with 20–30 minutes per day;;Split into two sessions if easily fatigued (e.g., 15 mins morning + 15 mins evening).",
    "whenToDo": "Morning and/or early evening after a light snack.",
    "howToIncrease": "If 30 mins feels easy, increase pace slightly or include 1–2 gentle inclines (if available).",
    "whenToStop": "If you feel pelvic pressure, uterine cramps, vaginal discharge, or fatigue — take a break immediately.",
    "avoidIf": "You have low-lying placenta (placenta previa), short cervix, or signs of early labour. Always confirm with your doctor.",
    "imageLink": "assets/images/exercises/walking_banner_no_text.webp"
  },
  {
    "title": "2. Pelvic Tilts (Cat-Cow Pose)",
    "howToDo": "Get on all fours on a yoga mat;;Inhale, arch your back (cow), look up;;Exhale, round your back (cat), look down toward your belly.",
    "repsPerDay": "2 sets of 10 repetitions, twice a day.",
    "whenToDo": "Morning and late afternoon. Avoid doing it right after meals.",
    "howToIncrease": "Gradually increase reps to 15–20 per session if comfortable.",
    "whenToStop": "Stop if you feel any wrist pressure, dizziness, or abdominal discomfort.",
    "avoidIf": "You have wrist issues, high blood pressure with dizziness, or restricted movement due to twin pregnancy or polyhydramnios.",
    "imageLink": "assets/images/exercises/cat_cow_banner_no_text_final.webp"
  },
  {
    "title": "3. Squats (with Support)",
    "howToDo": "Stand with feet shoulder-width apart;;Hold onto the back of a chair, bed, or wall for support;;Inhale and slowly squat down, keeping knees over toes;;Exhale and return to standing.",
    "repsPerDay": "Start with 5 squats, slowly increase to 15–20 per day.",
    "whenToDo": "Once daily — preferably after warming up with a walk.",
    "howToIncrease": "Increase depth and reps gradually, and do 2 sets of 10 squats once you feel stable.",
    "whenToStop": "If you feel pelvic pain, dizziness, or knee strain.",
    "avoidIf": "You have pelvic instability (symphysis pubis dysfunction), dizziness, or low-lying placenta.",
    "imageLink": "assets/images/exercises/squat_no_text.webp"
  },
  {
    "title": "4. Butterfly Pose (Baddha Konasana)",
    "howToDo": "Sit on a yoga mat or firm mattress;;Join your feet together in front of you, knees pointing outwards;;Hold your feet and gently flap your knees like butterfly wings.",
    "duration": "Start with 2–3 minutes, twice daily.",
    "whenToDo": "Anytime during the day when relaxed; best after walking.",
    "howToIncrease": "Increase to 5 minutes per session as flexibility improves.",
    "whenToStop": "Stop if you feel groin pain or leg numbness.",
    "avoidIf": "You have pelvic pain or recent vaginal bleeding. Use cushions under your thighs for support if needed.",
    "imageLink": "assets/images/exercises/butterfly_banner_no_text_final.webp"
  },
  {
    "title": "5. Wall-Supported Deep Breathing",
    "howToDo": "Stand with your back gently against a wall;;Close your eyes, rest your hands on your belly;;Inhale deeply through the nose for 4 seconds;;Hold for 2 seconds;;Exhale slowly through the mouth for 6 seconds",
    "duration": "Start with 5–10 minutes daily, increase as needed.",
    "whenToDo": "After exercise, before sleep, or during anxiety spells.",
    "howToIncrease": "Add soothing music or guided breathing meditation once you’re comfortable.",
    "whenToStop": "If you feel breathless, dizzy, or your heart races.",
    "avoidIf": "No specific contraindications — safe for most women unless advised rest due to preterm labour signs.",
    "imageLink": "assets/images/exercises/breathing_banner.webp"
  },
  {
    "title": "6. Pregnancy Ball Exercises (Birthing Ball Movements)",
    "variations": [
      {
        "name": "Pelvic Circles",
        "howToDo": "Sit upright on the ball with feet flat and slightly apart;;Rotate hips in gentle circles — clockwise and anticlockwise.",
        "repsPerDay": "10 circles each direction",
        "whenToDo": "After walking or when feeling stiff"
      },
      {
        "name": "Figure 8 Movements",
        "howToDo": "Same seated position. Move hips in a figure-8 shape.",
        "repsPerDay": "10–15 gentle reps",
        "whenToDo": "Once a day"
      },
      {
        "name": "Gentle Bouncing",
        "howToDo": "Sit comfortably, shoulders relaxed, and bounce lightly.",
        "duration": "2–3 minutes only",
        "whenToDo": "Once or twice daily — best done in the last 1–2 weeks of pregnancy"
      }
    ],
    "howToIncrease": "Start slow with 5–6 minutes total ball use per day. Slowly increase to 10–15 minutes as comfort allows. Always stop if there is any discomfort.",
    "whenToStop": "If you feel pelvic pain, heaviness, dizziness, or loss of balance. If contractions start prematurely or there's any fluid leakage.",
    "avoidIf": "You have pelvic instability (SPD). You're on bed rest. You have bleeding, leaking, or breech presentation (without doctor’s clearance).",
    "proTip": "Always use the ball on a non-slip floor, and preferably near a wall or bed for support. Choose the right size — 65 cm ball for average Indian height (5'3\"–5'7\").",
    "imageLink": "assets/images/exercises/ball_banner_no_text.webp"
  },
  {
    "title": "7. Malasana (Deep Squat or Garland Pose)",
    "howToDo": "Stand with feet slightly wider than hip-width;;Toes turned slightly outward;;Squat down slowly, keeping spine tall;;Bring palms together in front of chest in Namaste;;Elbows should press lightly against inner knees.",
    "duration": "Start with 30 seconds, twice daily. Slowly increase to 1–2 minutes per session.",
    "proTip": "Use a cushion under your heels or hold a bed/pillar if needed for balance.",
    "howToIncrease": "Begin with 2 squats per day of 30 seconds each. Gradually move to holding the pose for 1 minute twice daily. If you are already used to Indian-style squatting, increase slowly.",
    "whenToStop": "If you feel knee or ankle strain. If you feel pelvic pressure, dizziness, or vaginal heaviness. If your doctor asks you to avoid squatting for medical reasons.",
    "avoidIf": "You’ve had a previous cesarean with low-lying placenta. You’re experiencing bleeding, pelvic pain, or if the cord is around the baby’s neck. Your doctor has advised no squatting for specific conditions (e.g., high BP, IVF pregnancy).",
    "imageLink": "assets/images/exercises/malasana_banner_no_text.webp"
  }
]